OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  config_save_admin(quser, qpass);

  response->setCode(200);
  response->print("saved");
  request->send(response);
}

// -------------------------------------------------------------------
// Manually set the time
// url: /settime
// -------------------------------------------------------------------
void
handleSetTime(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  bool qsntp_enable = isPositive(request, "ntp");
  String qtz = request->getParam("tz");

  config_save_sntp(qsntp_enable, qtz);
  if(config_sntp_enabled()) {
    time_check_now();
  }

  if(false == qsntp_enable)
  {
    String time = request->getParam("time");

    struct tm tm;

    int yr, mnth, d, h, m, s;
    if(6 == sscanf( time.c_str(), "%4d-%2d-%2dT%2d:%2d:%2dZ", &yr, &mnth, &d, &h, &m, &s))
    {
      tm.tm_year = yr - 1900;
      tm.tm_mon = mnth - 1;
      tm.tm_mday = d;
      tm.tm_hour = h;
      tm.tm_min = m;
      tm.tm_sec = s;

      struct timeval set_time = {0,0};
      set_time.tv_sec = mktime(&tm);

      time_set_time(set_time, "manual");

    }
    else
    {
      response->setCode(400);
      response->print("could not parse time");
      request->send(response);
      return;
    }
  }

  response->setCode(200);
  response->print("set");
  request->send(response);
}

// -------------------------------------------------------------------
// Save advanced settings
// url: /saveadvanced
// -------------------------------------------------------------------
void
handleSaveAdvanced(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  String qhostname = request->getParam("hostname");
  String qsntp_host = request->getParam("sntp_host");

  config_save_advanced(qhostname, qsntp_host);

  response->setCode(200);
  response->print("saved");
  request->send(response);
}

// -------------------------------------------------------------------
// Save Tesla
// url: /savetesla
// -------------------------------------------------------------------
void
handleSaveTesla(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  String user = request->getParam("user");
  String pass = request->getParam("pass");
  bool enable = isPositive(request->getParam("enable"));
  config_save_tesla(enable, user, pass);

  teslaClient.setUser(user.c_str());
  teslaClient.setPass(pass.c_str());

  if (enable) {
    teslaClient.requestAccessToken();
  }

  char tmpStr[200];
  snprintf(tmpStr, sizeof(tmpStr), "Saved: %s %s",
           teslaClient.getUser(),
           teslaClient.getPass());
  DBUGLN(tmpStr);

  response->setCode(200);
  response->print(tmpStr);
  request->send(response);
}

// -------------------------------------------------------------------
// Save Tesla Vehicle Idx
// url: /saveteslavi
// -------------------------------------------------------------------
void
handleSaveTeslaVI(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  String svi = request->getParam("vi");
  int vehidx = atoi(svi.c_str());
  teslaClient.setVehicleIdx(vehidx);
  config_save_tesla_vehidx(vehidx);

  char tmpStr[200];
  snprintf(tmpStr, sizeof(tmpStr), "Saved: %s",svi.c_str());
  DBUGLN(tmpStr);

  response->setCode(200);
  response->print(tmpStr);
  request->send(response);
}

// -------------------------------------------------------------------
// Get Tesla Vehicle Info
// url: /teslaveh
// -------------------------------------------------------------------
void
handleTeslaVeh(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  String s = "{";
  int vc = teslaClient.getVehicleCnt();
  s += "\"count:\"" + String(vc);
  if (vc) {
    s += ",[";
    for (int i=0;i < vc;i++) {
      s += "{\"id\":\"" + teslaClient.getVehicleId(i) + "\",";
      s += "\"name\":\"" + teslaClient.getVehicleDisplayName(i) + "\"}";
      if (i < vc-1) s += ",";
    }
    s += "]";
  }
  s += "}";

  response->setCode(200);
  response->print(s);
  request->send(response);
}
// -------------------------------------------------------------------
// Save the Ohm keyto EEPROM
// url: /handleSaveOhmkey
// -------------------------------------------------------------------
void
handleSaveOhmkey(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  bool enabled = isPositive(request->getParam("enable"));
  String qohm = request->getParam("ohm");

  config_save_ohm(enabled, qohm);

  response->setCode(200);
  response->print("saved");
  request->send(response);
}

// -------------------------------------------------------------------
// Returns status json
// url: /status
// -------------------------------------------------------------------
void
handleStatus(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  // Get the current time
  struct timeval local_time;
  gettimeofday(&local_time, NULL);

  struct tm * timeinfo = gmtime(&local_time.tv_sec);

  char time[64];
  char offset[8];
  strftime(time, sizeof(time), "%FT%TZ", timeinfo);
  strftime(offset, sizeof(offset), "%z", timeinfo);

  String s = "{";
  if (net_eth_connected()) {
    s += "\"mode\":\"Wired\",";
  } else if (net_wifi_mode_is_sta_only()) {
    s += "\"mode\":\"STA\",";
  } else if (net_wifi_mode_is_ap_only()) {
    s += "\"mode\":\"AP\",";
  } else if (net_wifi_mode_is_ap() && net_wifi_mode_is_sta()) {
    s += "\"mode\":\"STA+AP\",";
  }

  s += "\"wifi_client_connected\":" + String(net_wifi_client_connected()) + ",";
  s += "\"eth_connected\":" + String(net_eth_connected()) + ",";
  s += "\"net_connected\":" + String(net_is_connected()) + ",";
  s += "\"srssi\":" + String(WiFi.RSSI()) + ",";
  s += "\"ipaddress\":\"" + ipaddress + "\",";

