OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  s += "\"emoncms_connected\":" + String(emoncms_connected) + ",";
  s += "\"packets_sent\":" + String(packets_sent) + ",";
  s += "\"packets_success\":" + String(packets_success) + ",";

  s += "\"mqtt_connected\":" + String(mqtt_connected()) + ",";

  s += "\"ohm_hour\":\"" + ohm_hour + "\",";

  s += "\"free_heap\":" + String(HAL.getFreeHeap()) + ",";

  s += "\"comm_sent\":" + String(rapiSender.getSent()) + ",";
  s += "\"comm_success\":" + String(rapiSender.getSuccess()) + ",";
  s += "\"rapi_connected\":" + String(rapiSender.isConnected()) + ",";

  s += "\"amp\":" + String(amp) + ",";
  s += "\"pilot\":" + String(pilot) + ",";
  s += "\"temp1\":" + String(temp1) + ",";
  s += "\"temp2\":" + String(temp2) + ",";
  s += "\"temp3\":" + String(temp3) + ",";
  s += "\"state\":" + String(state) + ",";
  s += "\"elapsed\":" + String(elapsed) + ",";
  s += "\"wattsec\":" + String(wattsec) + ",";
  s += "\"watthour\":" + String(watthour_total) + ",";

  s += "\"gfcicount\":" + String(gfci_count) + ",";
  s += "\"nogndcount\":" + String(nognd_count) + ",";
  s += "\"stuckcount\":" + String(stuck_count) + ",";

  s += "\"divertmode\":" + String(divertmode) + ",";
  s += "\"solar\":" + String(solar) + ",";
  s += "\"grid_ie\":" + String(grid_ie) + ",";
  s += "\"charge_rate\":" + String(charge_rate) + ",";
  s += "\"divert_update\":" + String((millis() - lastUpdate) / 1000) + ",";

  s += "\"ota_update\":" + String(Update.isRunning()) + ",";
  s += "\"time\":\"" + String(time) + "\",";
  s += "\"offset\":\"" + String(offset) + "\"";
  {
    const TESLA_CHARGE_INFO *tci = teslaClient.getChargeInfo();
    if (tci->isValid) {
      s += "\"batteryRange\":" + String(tci->batteryRange) + ",";
      s += "\"chargeEnergyAdded\":" + String(tci->chargeEnergyAdded) + ",";
      s += "\"chargeMilesAddedRated\":" + String(tci->chargeMilesAddedRated) + ",";
      s += "\"batteryLevel\":" + String(tci->batteryLevel) + ",";
      s += "\"chargeLimitSOC\":" + String(tci->chargeLimitSOC) + ",";
      s += "\"timeToFullCharge\":" + String(tci->timeToFullCharge) + ",";
      s += "\"chargerVoltage\":" + String(tci->chargerVoltage) + ",";
    }
  }

#ifdef ENABLE_LEGACY_API
  s += ",\"networks\":[" + st + "]";
  s += ",\"rssi\":[" + rssi + "]";
  s += ",\"version\":\"" + currentfirmware + "\"";
  s += ",\"ssid\":\"" + esid + "\"";
  //s += ",\"pass\":\""+epass+"\""; security risk: DONT RETURN PASSWORDS
  s += ",\"emoncms_server\":\"" + emoncms_server + "\"";
  s += ",\"emoncms_node\":\"" + emoncms_node + "\"";
  //s += ",\"emoncms_apikey\":\""+emoncms_apikey+"\""; security risk: DONT RETURN APIKEY
  s += ",\"emoncms_fingerprint\":\"" + emoncms_fingerprint + "\"";
  s += ",\"mqtt_server\":\"" + mqtt_server + "\"";
  s += ",\"mqtt_topic\":\"" + mqtt_topic + "\"";
  s += ",\"mqtt_user\":\"" + mqtt_user + "\"";
  //s += ",\"mqtt_pass\":\""+mqtt_pass+"\""; security risk: DONT RETURN PASSWORDS
  s += ",\"www_username\":\"" + www_username + "\"";
  //s += ",\"www_password\":\""+www_password+"\""; security risk: DONT RETURN PASSWORDS
  s += ",\"ohmkey\":\"" + ohm + "\"";
#endif
  s += "}";

  response->setCode(200);
  response->print(s);
  request->send(response);
}

// -------------------------------------------------------------------
// Returns OpenEVSE Config json
// url: /config
// -------------------------------------------------------------------
void
handleConfig(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

  String dummyPassword = String(DUMMY_PASSWORD);

  String s = "{";
  s += "\"firmware\":\"" + firmware + "\",";
  s += "\"protocol\":\"" + protocol + "\",";
  s += "\"espflash\":" + String(HAL.getFlashChipSize()) + ",";
  s += "\"version\":\"" + currentfirmware + "\",";
  s += "\"diodet\":" + String(diode_ck) + ",";
  s += "\"gfcit\":" + String(gfci_test) + ",";
  s += "\"groundt\":" + String(ground_ck) + ",";
  s += "\"relayt\":" + String(stuck_relay) + ",";
  s += "\"ventt\":" + String(vent_ck) + ",";
  s += "\"tempt\":" + String(temp_ck) + ",";
  s += "\"service\":" + String(service) + ",";
#ifdef ENABLE_LEGACY_API
  s += "\"l1min\":\"" + current_l1min + "\",";
  s += "\"l1max\":\"" + current_l1max + "\",";
  s += "\"l2min\":\"" + current_l2min + "\",";
  s += "\"l2max\":\"" + current_l2max + "\",";
  s += "\"kwhlimit\":\"" + kwh_limit + "\",";
  s += "\"timelimit\":\"" + time_limit + "\",";
  s += "\"gfcicount\":" + String(gfci_count) + ",";
  s += "\"nogndcount\":" + String(nognd_count) + ",";
  s += "\"stuckcount\":" + String(stuck_count) + ",";
#endif
  s += "\"scale\":" + String(current_scale) + ",";
  s += "\"offset\":" + String(current_offset) + ",";
  s += "\"ssid\":\"" + esid + "\",";
  s += "\"pass\":\"";
  if(epass != 0) {
    s += dummyPassword;
  }
  s += "\",";
  s += "\"emoncms_enabled\":" + String(config_emoncms_enabled() ? "true" : "false") + ",";
  s += "\"emoncms_server\":\"" + emoncms_server + "\",";
  s += "\"emoncms_node\":\"" + emoncms_node + "\",";
  s += "\"emoncms_apikey\":\"";
  if(emoncms_apikey != 0) {
    s += dummyPassword;
  }
  s += "\",";
  s += "\"emoncms_fingerprint\":\"" + emoncms_fingerprint + "\",";
  s += "\"mqtt_enabled\":" + String(config_mqtt_enabled() ? "true" : "false") + ",";
  s += "\"mqtt_protocol\":\"" + String(0 == config_mqtt_protocol() ? "mqtt" : "mqtts") + "\",";
  s += "\"mqtt_server\":\"" + mqtt_server + "\",";
  s += "\"mqtt_port\":" + String(mqtt_port) + ",";
  s += "\"mqtt_reject_unauthorized\":" + String(config_mqtt_reject_unauthorized() ? "true" : "false") + ",";
  s += "\"mqtt_topic\":\"" + mqtt_topic + "\",";
  s += "\"mqtt_user\":\"" + mqtt_user + "\",";
  s += "\"mqtt_pass\":\"";
  if(mqtt_pass != 0) {
    s += dummyPassword;
  }
  s += "\",";
  s += "\"mqtt_solar\":\""+mqtt_solar+"\",";
  s += "\"mqtt_grid_ie\":\""+mqtt_grid_ie+"\",";
  s += "\"mqtt_supported_protocols\":[\"mqtt\",\"mqtts\"],";
  s += "\"http_supported_protocols\":[\"http\",\"https\"],";
  s += "\"www_username\":\"" + www_username + "\",";
  s += "\"www_password\":\"";
  if(www_password != 0) {
    s += dummyPassword;
  }
  s += "\",";
  s += "\"hostname\":\"" + esp_hostname + "\",";
  s += "\"time_zone\":\"" + time_zone + "\",";
  s += "\"sntp_enabled\":" + String(config_sntp_enabled() ? "true" : "false") + ",";
  s += "\"sntp_host\":\"" + sntp_hostname + "\",";
  s += "\"tesla_user\":\"" + String(teslaClient.getUser()) + "\",";
  s += "\"tesla_vehidx\":" + String(teslaClient.getCurVehicleIdx()) + ",";
  s += "\"ohm_enabled\":" + String(config_ohm_enabled() ? "true" : "false");
  s += "}";

  response->setCode(200);
  response->print(s);
  request->send(response);
}

#ifdef ENABLE_LEGACY_API
// -------------------------------------------------------------------
// Returns Updates JSON
// url: /rapiupdate
// -------------------------------------------------------------------
void
handleUpdate(MongooseHttpServerRequest *request) {

  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response)) {
    return;
  }

